small_pipe_low_viscocity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    movingWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       2320;
    }
    leftSide
    {
        type            patch;
        nFaces          20;
        startFace       2380;
    }
    rightSide
    {
        type            patch;
        nFaces          20;
        startFace       2400;
    }
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       2420;
    }
    bottomWall2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       2460;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2400;
        startFace       2480;
    }
)

// ************************************************************************* //
